# Notebook para conexión con las bases

Este notebook inicialmente consiste en un ejemplo pequeño para aprender a utilizar **mysql** desde **python**, realizando una query para crear una base de datos llamada *test*

### Ejemplo de conexión

In [5]:
import mysql.connector as connection
import pandas as pd

In [4]:
try:
    mydb=connection.connect(
    host="localhost",
    user="root",
    passwd="daniel97",
    use_pure=True)
    #Se mira si hay conexión
    
    query="create database Test"
    
    cursor=mydb.cursor() #Cursor para aplicar queries
    cursor.execute(query)
    print(cursor.fetchall())
    
except Exception as e:
    mydb.close()
    print(str(e))

1007 (HY000): Can't create database 'Test'; database exists

## Conexión base de datos NBA

En esta parte nos conectamos a la base de datos NBA creada dentro de MySQL por medio de Workbench

In [7]:
NBA=connection.connect(
    host="localhost",
    user="root",
    passwd="daniel97",
    db="NBA"
)

In [10]:
tabla="games"
query=f"""
select SEASON as temporada,
    count(SEASON) as conteo
from NBA.{tabla}
group by SEASON
order by SEASON desc
"""

In [11]:
temporadas=pd.read_sql_query(query,NBA)

In [12]:
temporadas

    temporada  conteo
0        2022     542
1        2021    1389
2        2020    1249
3        2019    1241
4        2018    1378
5        2017    1382
6        2016    1405
7        2015    1416
8        2014    1418
9        2013    1427
10       2012    1420
11       2011    1104
12       2010    1422
13       2009    1424
14       2008    1425
15       2007    1411
16       2006    1419
17       2005    1432
18       2004    1362
19       2003    1286